MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0SITB/mcu.h
/*  Bit definition for EFM_CHIPID register  */
#define EFM_CHIPID                                     (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID0 register  */
#define EFM_UQID0                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID1 register  */
#define EFM_UQID1                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID2 register  */
#define EFM_UQID2                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_MMF_REMPRT register  */
#define EFM_MMF_REMPRT_MMF_REMPRT                      (0x0000FFFFUL)

/*  Bit definition for EFM_MMF_REMCR register  */
#define EFM_MMF_REMCR_RMSIZE_POS                       (0U)
#define EFM_MMF_REMCR_RMSIZE                           (0x0000001FUL)
#define EFM_MMF_REMCR_RMTADDR_POS                      (12U)
#define EFM_MMF_REMCR_RMTADDR                          (0x1FFFF000UL)
#define EFM_MMF_REMCR_EN_POS                           (31U)
#define EFM_MMF_REMCR_EN                               (0x80000000UL)

/*  Bit definition for EFM_WLOCK register  */
#define EFM_WLOCK_WLOCK                                (0x000000FFUL)
#define EFM_WLOCK_WLOCK_0                              (0x00000001UL)
#define EFM_WLOCK_WLOCK_1                              (0x00000002UL)
#define EFM_WLOCK_WLOCK_2                              (0x00000004UL)
#define EFM_WLOCK_WLOCK_3                              (0x00000008UL)
#define EFM_WLOCK_WLOCK_4                              (0x00000010UL)
#define EFM_WLOCK_WLOCK_5                              (0x00000020UL)
#define EFM_WLOCK_WLOCK_6                              (0x00000040UL)
#define EFM_WLOCK_WLOCK_7                              (0x00000080UL)

/*  Bit definition for EFM_F0NWPRT0 register  */
#define EFM_F0NWPRT0_F0NWPRT0_POS                      (0U)
#define EFM_F0NWPRT0_F0NWPRT0                          (0x00000001UL)
#define EFM_F0NWPRT0_F0NWPRT1_POS                      (1U)
#define EFM_F0NWPRT0_F0NWPRT1                          (0x00000002UL)
#define EFM_F0NWPRT0_F0NWPRT2_POS                      (2U)
#define EFM_F0NWPRT0_F0NWPRT2                          (0x00000004UL)
#define EFM_F0NWPRT0_F0NWPRT3_POS                      (3U)
#define EFM_F0NWPRT0_F0NWPRT3                          (0x00000008UL)
#define EFM_F0NWPRT0_F0NWPRT4_POS                      (4U)
#define EFM_F0NWPRT0_F0NWPRT4                          (0x00000010UL)
#define EFM_F0NWPRT0_F0NWPRT5_POS                      (5U)
#define EFM_F0NWPRT0_F0NWPRT5                          (0x00000020UL)
#define EFM_F0NWPRT0_F0NWPRT6_POS                      (6U)
#define EFM_F0NWPRT0_F0NWPRT6                          (0x00000040UL)
#define EFM_F0NWPRT0_F0NWPRT7_POS                      (7U)
#define EFM_F0NWPRT0_F0NWPRT7                          (0x00000080UL)
#define EFM_F0NWPRT0_F0NWPRT8_POS                      (8U)
#define EFM_F0NWPRT0_F0NWPRT8                          (0x00000100UL)
#define EFM_F0NWPRT0_F0NWPRT9_POS                      (9U)
#define EFM_F0NWPRT0_F0NWPRT9                          (0x00000200UL)
#define EFM_F0NWPRT0_F0NWPRT10_POS                     (10U)
#define EFM_F0NWPRT0_F0NWPRT10                         (0x00000400UL)
#define EFM_F0NWPRT0_F0NWPRT11_POS                     (11U)
#define EFM_F0NWPRT0_F0NWPRT11                         (0x00000800UL)
#define EFM_F0NWPRT0_F0NWPRT12_POS                     (12U)
#define EFM_F0NWPRT0_F0NWPRT12                         (0x00001000UL)
#define EFM_F0NWPRT0_F0NWPRT13_POS                     (13U)
#define EFM_F0NWPRT0_F0NWPRT13                         (0x00002000UL)
#define EFM_F0NWPRT0_F0NWPRT14_POS                     (14U)
#define EFM_F0NWPRT0_F0NWPRT14                         (0x00004000UL)
#define EFM_F0NWPRT0_F0NWPRT15_POS                     (15U)
#define EFM_F0NWPRT0_F0NWPRT15                         (0x00008000UL)
#define EFM_F0NWPRT0_F0NWPRT16_POS                     (16U)
#define EFM_F0NWPRT0_F0NWPRT16                         (0x00010000UL)
#define EFM_F0NWPRT0_F0NWPRT17_POS                     (17U)
#define EFM_F0NWPRT0_F0NWPRT17                         (0x00020000UL)
#define EFM_F0NWPRT0_F0NWPRT18_POS                     (18U)
#define EFM_F0NWPRT0_F0NWPRT18                         (0x00040000UL)
#define EFM_F0NWPRT0_F0NWPRT19_POS                     (19U)
#define EFM_F0NWPRT0_F0NWPRT19                         (0x00080000UL)
#define EFM_F0NWPRT0_F0NWPRT20_POS                     (20U)
#define EFM_F0NWPRT0_F0NWPRT20                         (0x00100000UL)
#define EFM_F0NWPRT0_F0NWPRT21_POS                     (21U)
#define EFM_F0NWPRT0_F0NWPRT21                         (0x00200000UL)
#define EFM_F0NWPRT0_F0NWPRT22_POS                     (22U)
#define EFM_F0NWPRT0_F0NWPRT22                         (0x00400000UL)
#define EFM_F0NWPRT0_F0NWPRT23_POS                     (23U)
#define EFM_F0NWPRT0_F0NWPRT23                         (0x00800000UL)
#define EFM_F0NWPRT0_F0NWPRT24_POS                     (24U)
#define EFM_F0NWPRT0_F0NWPRT24                         (0x01000000UL)
#define EFM_F0NWPRT0_F0NWPRT25_POS                     (25U)
#define EFM_F0NWPRT0_F0NWPRT25                         (0x02000000UL)
#define EFM_F0NWPRT0_F0NWPRT26_POS                     (26U)
#define EFM_F0NWPRT0_F0NWPRT26                         (0x04000000UL)
#define EFM_F0NWPRT0_F0NWPRT27_POS                     (27U)
#define EFM_F0NWPRT0_F0NWPRT27                         (0x08000000UL)
#define EFM_F0NWPRT0_F0NWPRT28_POS                     (28U)
#define EFM_F0NWPRT0_F0NWPRT28                         (0x10000000UL)
#define EFM_F0NWPRT0_F0NWPRT29_POS                     (29U)
#define EFM_F0NWPRT0_F0NWPRT29                         (0x20000000UL)
#define EFM_F0NWPRT0_F0NWPRT30_POS                     (30U)
#define EFM_F0NWPRT0_F0NWPRT30                         (0x40000000UL)
#define EFM_F0NWPRT0_F0NWPRT31_POS                     (31U)
#define EFM_F0NWPRT0_F0NWPRT31                         (0x80000000UL)

/*  Bit definition for EFM_F0NWPRT1 register  */
#define EFM_F0NWPRT1_F0NWPRT32_POS                     (0U)
#define EFM_F0NWPRT1_F0NWPRT32                         (0x00000001UL)
#define EFM_F0NWPRT1_F0NWPRT33_POS                     (1U)
#define EFM_F0NWPRT1_F0NWPRT33                         (0x00000002UL)
#define EFM_F0NWPRT1_F0NWPRT34_POS                     (2U)
#define EFM_F0NWPRT1_F0NWPRT34                         (0x00000004UL)
#define EFM_F0NWPRT1_F0NWPRT35_POS                     (3U)
#define EFM_F0NWPRT1_F0NWPRT35                         (0x00000008UL)
#define EFM_F0NWPRT1_F0NWPRT36_POS                     (4U)
#define EFM_F0NWPRT1_F0NWPRT36                         (0x00000010UL)
#define EFM_F0NWPRT1_F0NWPRT37_POS                     (5U)
#define EFM_F0NWPRT1_F0NWPRT37                         (0x00000020UL)
#define EFM_F0NWPRT1_F0NWPRT38_POS                     (6U)
#define EFM_F0NWPRT1_F0NWPRT38                         (0x00000040UL)
#define EFM_F0NWPRT1_F0NWPRT39_POS                     (7U)
#define EFM_F0NWPRT1_F0NWPRT39                         (0x00000080UL)
#define EFM_F0NWPRT1_F0NWPRT40_POS                     (8U)
#define EFM_F0NWPRT1_F0NWPRT40                         (0x00000100UL)
#define EFM_F0NWPRT1_F0NWPRT41_POS                     (9U)
#define EFM_F0NWPRT1_F0NWPRT41                         (0x00000200UL)
#define EFM_F0NWPRT1_F0NWPRT42_POS                     (10U)
#define EFM_F0NWPRT1_F0NWPRT42                         (0x00000400UL)
#define EFM_F0NWPRT1_F0NWPRT43_POS                     (11U)
#define EFM_F0NWPRT1_F0NWPRT43                         (0x00000800UL)
#define EFM_F0NWPRT1_F0NWPRT44_POS                     (12U)
#define EFM_F0NWPRT1_F0NWPRT44                         (0x00001000UL)
#define EFM_F0NWPRT1_F0NWPRT45_POS                     (13U)
#define EFM_F0NWPRT1_F0NWPRT45                         (0x00002000UL)
#define EFM_F0NWPRT1_F0NWPRT46_POS                     (14U)
#define EFM_F0NWPRT1_F0NWPRT46                         (0x00004000UL)
#define EFM_F0NWPRT1_F0NWPRT47_POS                     (15U)
#define EFM_F0NWPRT1_F0NWPRT47                         (0x00008000UL)
#define EFM_F0NWPRT1_F0NWPRT48_POS                     (16U)
#define EFM_F0NWPRT1_F0NWPRT48                         (0x00010000UL)
#define EFM_F0NWPRT1_F0NWPRT49_POS                     (17U)
#define EFM_F0NWPRT1_F0NWPRT49                         (0x00020000UL)
#define EFM_F0NWPRT1_F0NWPRT50_POS                     (18U)
#define EFM_F0NWPRT1_F0NWPRT50                         (0x00040000UL)
#define EFM_F0NWPRT1_F0NWPRT51_POS                     (19U)
#define EFM_F0NWPRT1_F0NWPRT51                         (0x00080000UL)
#define EFM_F0NWPRT1_F0NWPRT52_POS                     (20U)
#define EFM_F0NWPRT1_F0NWPRT52                         (0x00100000UL)
#define EFM_F0NWPRT1_F0NWPRT53_POS                     (21U)
#define EFM_F0NWPRT1_F0NWPRT53                         (0x00200000UL)
#define EFM_F0NWPRT1_F0NWPRT54_POS                     (22U)
#define EFM_F0NWPRT1_F0NWPRT54                         (0x00400000UL)
#define EFM_F0NWPRT1_F0NWPRT55_POS                     (23U)
#define EFM_F0NWPRT1_F0NWPRT55                         (0x00800000UL)
#define EFM_F0NWPRT1_F0NWPRT56_POS                     (24U)
#define EFM_F0NWPRT1_F0NWPRT56                         (0x01000000UL)
#define EFM_F0NWPRT1_F0NWPRT57_POS                     (25U)
#define EFM_F0NWPRT1_F0NWPRT57                         (0x02000000UL)
#define EFM_F0NWPRT1_F0NWPRT58_POS                     (26U)
#define EFM_F0NWPRT1_F0NWPRT58                         (0x04000000UL)
#define EFM_F0NWPRT1_F0NWPRT59_POS                     (27U)
#define EFM_F0NWPRT1_F0NWPRT59                         (0x08000000UL)
#define EFM_F0NWPRT1_F0NWPRT60_POS                     (28U)
#define EFM_F0NWPRT1_F0NWPRT60                         (0x10000000UL)
#define EFM_F0NWPRT1_F0NWPRT61_POS                     (29U)
#define EFM_F0NWPRT1_F0NWPRT61                         (0x20000000UL)
#define EFM_F0NWPRT1_F0NWPRT62_POS                     (30U)
#define EFM_F0NWPRT1_F0NWPRT62                         (0x40000000UL)
#define EFM_F0NWPRT1_F0NWPRT63_POS                     (31U)
#define EFM_F0NWPRT1_F0NWPRT63                         (0x80000000UL)

/*  Bit definition for EFM_F0NWPRT2 register  */
#define EFM_F0NWPRT2_F0NWPRT64_POS                     (0U)
#define EFM_F0NWPRT2_F0NWPRT64                         (0x00000001UL)
#define EFM_F0NWPRT2_F0NWPRT65_POS                     (1U)
#define EFM_F0NWPRT2_F0NWPRT65                         (0x00000002UL)
#define EFM_F0NWPRT2_F0NWPRT66_POS                     (2U)
#define EFM_F0NWPRT2_F0NWPRT66                         (0x00000004UL)
#define EFM_F0NWPRT2_F0NWPRT67_POS                     (3U)
#define EFM_F0NWPRT2_F0NWPRT67                         (0x00000008UL)
#define EFM_F0NWPRT2_F0NWPRT68_POS                     (4U)
#define EFM_F0NWPRT2_F0NWPRT68                         (0x00000010UL)
#define EFM_F0NWPRT2_F0NWPRT69_POS                     (5U)
#define EFM_F0NWPRT2_F0NWPRT69                         (0x00000020UL)
#define EFM_F0NWPRT2_F0NWPRT70_POS                     (6U)
#define EFM_F0NWPRT2_F0NWPRT70                         (0x00000040UL)
#define EFM_F0NWPRT2_F0NWPRT71_POS                     (7U)
#define EFM_F0NWPRT2_F0NWPRT71                         (0x00000080UL)
#define EFM_F0NWPRT2_F0NWPRT72_POS                     (8U)
#define EFM_F0NWPRT2_F0NWPRT72                         (0x00000100UL)
#define EFM_F0NWPRT2_F0NWPRT73_POS                     (9U)
#define EFM_F0NWPRT2_F0NWPRT73                         (0x00000200UL)
#define EFM_F0NWPRT2_F0NWPRT74_POS                     (10U)
#define EFM_F0NWPRT2_F0NWPRT74                         (0x00000400UL)
#define EFM_F0NWPRT2_F0NWPRT75_POS                     (11U)
#define EFM_F0NWPRT2_F0NWPRT75                         (0x00000800UL)
#define EFM_F0NWPRT2_F0NWPRT76_POS                     (12U)
#define EFM_F0NWPRT2_F0NWPRT76                         (0x00001000UL)
#define EFM_F0NWPRT2_F0NWPRT77_POS                     (13U)
#define EFM_F0NWPRT2_F0NWPRT77                         (0x00002000UL)
#define EFM_F0NWPRT2_F0NWPRT78_POS                     (14U)
#define EFM_F0NWPRT2_F0NWPRT78                         (0x00004000UL)
#define EFM_F0NWPRT2_F0NWPRT79_POS                     (15U)
#define EFM_F0NWPRT2_F0NWPRT79                         (0x00008000UL)
#define EFM_F0NWPRT2_F0NWPRT80_POS                     (16U)
#define EFM_F0NWPRT2_F0NWPRT80                         (0x00010000UL)
#define EFM_F0NWPRT2_F0NWPRT81_POS                     (17U)
#define EFM_F0NWPRT2_F0NWPRT81                         (0x00020000UL)
#define EFM_F0NWPRT2_F0NWPRT82_POS                     (18U)
#define EFM_F0NWPRT2_F0NWPRT82                         (0x00040000UL)
#define EFM_F0NWPRT2_F0NWPRT83_POS                     (19U)
#define EFM_F0NWPRT2_F0NWPRT83                         (0x00080000UL)
#define EFM_F0NWPRT2_F0NWPRT84_POS                     (20U)
#define EFM_F0NWPRT2_F0NWPRT84                         (0x00100000UL)
#define EFM_F0NWPRT2_F0NWPRT85_POS                     (21U)
#define EFM_F0NWPRT2_F0NWPRT85                         (0x00200000UL)
#define EFM_F0NWPRT2_F0NWPRT86_POS                     (22U)
#define EFM_F0NWPRT2_F0NWPRT86                         (0x00400000UL)
#define EFM_F0NWPRT2_F0NWPRT87_POS                     (23U)
#define EFM_F0NWPRT2_F0NWPRT87                         (0x00800000UL)
#define EFM_F0NWPRT2_F0NWPRT88_POS                     (24U)
#define EFM_F0NWPRT2_F0NWPRT88                         (0x01000000UL)
#define EFM_F0NWPRT2_F0NWPRT89_POS                     (25U)
#define EFM_F0NWPRT2_F0NWPRT89                         (0x02000000UL)
#define EFM_F0NWPRT2_F0NWPRT90_POS                     (26U)
#define EFM_F0NWPRT2_F0NWPRT90                         (0x04000000UL)
#define EFM_F0NWPRT2_F0NWPRT91_POS                     (27U)
#define EFM_F0NWPRT2_F0NWPRT91                         (0x08000000UL)
#define EFM_F0NWPRT2_F0NWPRT92_POS                     (28U)
#define EFM_F0NWPRT2_F0NWPRT92                         (0x10000000UL)
#define EFM_F0NWPRT2_F0NWPRT93_POS                     (29U)
#define EFM_F0NWPRT2_F0NWPRT93                         (0x20000000UL)
#define EFM_F0NWPRT2_F0NWPRT94_POS                     (30U)
#define EFM_F0NWPRT2_F0NWPRT94                         (0x40000000UL)
#define EFM_F0NWPRT2_F0NWPRT95_POS                     (31U)
#define EFM_F0NWPRT2_F0NWPRT95                         (0x80000000UL)

/*  Bit definition for EFM_F0NWPRT3 register  */
#define EFM_F0NWPRT3_F0NWPRT96_POS                     (0U)
#define EFM_F0NWPRT3_F0NWPRT96                         (0x00000001UL)
#define EFM_F0NWPRT3_F0NWPRT97_POS                     (1U)
#define EFM_F0NWPRT3_F0NWPRT97                         (0x00000002UL)
#define EFM_F0NWPRT3_F0NWPRT98_POS                     (2U)
#define EFM_F0NWPRT3_F0NWPRT98                         (0x00000004UL)
#define EFM_F0NWPRT3_F0NWPRT99_POS                     (3U)
#define EFM_F0NWPRT3_F0NWPRT99                         (0x00000008UL)
#define EFM_F0NWPRT3_F0NWPRT100_POS                    (4U)
#define EFM_F0NWPRT3_F0NWPRT100                        (0x00000010UL)
#define EFM_F0NWPRT3_F0NWPRT101_POS                    (5U)
#define EFM_F0NWPRT3_F0NWPRT101                        (0x00000020UL)
#define EFM_F0NWPRT3_F0NWPRT102_POS                    (6U)
#define EFM_F0NWPRT3_F0NWPRT102                        (0x00000040UL)
#define EFM_F0NWPRT3_F0NWPRT103_POS                    (7U)
#define EFM_F0NWPRT3_F0NWPRT103                        (0x00000080UL)
#define EFM_F0NWPRT3_F0NWPRT104_POS                    (8U)
#define EFM_F0NWPRT3_F0NWPRT104                        (0x00000100UL)
#define EFM_F0NWPRT3_F0NWPRT105_POS                    (9U)
#define EFM_F0NWPRT3_F0NWPRT105                        (0x00000200UL)
#define EFM_F0NWPRT3_F0NWPRT106_POS                    (10U)
#define EFM_F0NWPRT3_F0NWPRT106                        (0x00000400UL)
#define EFM_F0NWPRT3_F0NWPRT107_POS                    (11U)
#define EFM_F0NWPRT3_F0NWPRT107                        (0x00000800UL)
#define EFM_F0NWPRT3_F0NWPRT108_POS                    (12U)
#define EFM_F0NWPRT3_F0NWPRT108                        (0x00001000UL)
#define EFM_F0NWPRT3_F0NWPRT109_POS                    (13U)
#define EFM_F0NWPRT3_F0NWPRT109                        (0x00002000UL)
#define EFM_F0NWPRT3_F0NWPRT110_POS                    (14U)
#define EFM_F0NWPRT3_F0NWPRT110                        (0x00004000UL)
#define EFM_F0NWPRT3_F0NWPRT111_POS                    (15U)
#define EFM_F0NWPRT3_F0NWPRT111                        (0x00008000UL)
#define EFM_F0NWPRT3_F0NWPRT112_POS                    (16U)
#define EFM_F0NWPRT3_F0NWPRT112                        (0x00010000UL)
#define EFM_F0NWPRT3_F0NWPRT113_POS                    (17U)
#define EFM_F0NWPRT3_F0NWPRT113                        (0x00020000UL)
#define EFM_F0NWPRT3_F0NWPRT114_POS                    (18U)
#define EFM_F0NWPRT3_F0NWPRT114                        (0x00040000UL)
#define EFM_F0NWPRT3_F0NWPRT115_POS                    (19U)
#define EFM_F0NWPRT3_F0NWPRT115                        (0x00080000UL)
#define EFM_F0NWPRT3_F0NWPRT116_POS                    (20U)
#define EFM_F0NWPRT3_F0NWPRT116                        (0x00100000UL)
#define EFM_F0NWPRT3_F0NWPRT117_POS                    (21U)
#define EFM_F0NWPRT3_F0NWPRT117                        (0x00200000UL)
#define EFM_F0NWPRT3_F0NWPRT118_POS                    (22U)
#define EFM_F0NWPRT3_F0NWPRT118                        (0x00400000UL)
#define EFM_F0NWPRT3_F0NWPRT119_POS                    (23U)
#define EFM_F0NWPRT3_F0NWPRT119                        (0x00800000UL)
#define EFM_F0NWPRT3_F0NWPRT120_POS                    (24U)
#define EFM_F0NWPRT3_F0NWPRT120                        (0x01000000UL)
#define EFM_F0NWPRT3_F0NWPRT121_POS                    (25U)
#define EFM_F0NWPRT3_F0NWPRT121                        (0x02000000UL)
#define EFM_F0NWPRT3_F0NWPRT122_POS                    (26U)
#define EFM_F0NWPRT3_F0NWPRT122                        (0x04000000UL)
#define EFM_F0NWPRT3_F0NWPRT123_POS                    (27U)
#define EFM_F0NWPRT3_F0NWPRT123                        (0x08000000UL)
#define EFM_F0NWPRT3_F0NWPRT124_POS                    (28U)
#define EFM_F0NWPRT3_F0NWPRT124                        (0x10000000UL)
#define EFM_F0NWPRT3_F0NWPRT125_POS                    (29U)
#define EFM_F0NWPRT3_F0NWPRT125                        (0x20000000UL)
#define EFM_F0NWPRT3_F0NWPRT126_POS                    (30U)
#define EFM_F0NWPRT3_F0NWPRT126                        (0x40000000UL)
#define EFM_F0NWPRT3_F0NWPRT127_POS                    (31U)
#define EFM_F0NWPRT3_F0NWPRT127                        (0x80000000UL)

