MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0SITB/mcu.h
/*  Bit definition for ETH_PTP_TSPCTLR register  */
#define ETH_PTP_TSPCTLR_TSPEN_POS                      (0U)
#define ETH_PTP_TSPCTLR_TSPEN                          (0x00000001UL)
#define ETH_PTP_TSPCTLR_TSPUPSEL_POS                   (1U)
#define ETH_PTP_TSPCTLR_TSPUPSEL                       (0x00000002UL)
#define ETH_PTP_TSPCTLR_TSPINI_POS                     (2U)
#define ETH_PTP_TSPCTLR_TSPINI                         (0x00000004UL)
#define ETH_PTP_TSPCTLR_TSPUP_POS                      (3U)
#define ETH_PTP_TSPCTLR_TSPUP                          (0x00000008UL)
#define ETH_PTP_TSPCTLR_TSPINT_POS                     (4U)
#define ETH_PTP_TSPCTLR_TSPINT                         (0x00000010UL)
#define ETH_PTP_TSPCTLR_TSPADUP_POS                    (5U)
#define ETH_PTP_TSPCTLR_TSPADUP                        (0x00000020UL)
#define ETH_PTP_TSPCTLR_TSPEALL_POS                    (8U)
#define ETH_PTP_TSPCTLR_TSPEALL                        (0x00000100UL)
#define ETH_PTP_TSPCTLR_TSPSSR_POS                     (9U)
#define ETH_PTP_TSPCTLR_TSPSSR                         (0x00000200UL)
#define ETH_PTP_TSPCTLR_TSPVER_POS                     (10U)
#define ETH_PTP_TSPCTLR_TSPVER                         (0x00000400UL)
#define ETH_PTP_TSPCTLR_TSPOVETH_POS                   (11U)
#define ETH_PTP_TSPCTLR_TSPOVETH                       (0x00000800UL)
#define ETH_PTP_TSPCTLR_TSPOVIPV6_POS                  (12U)
#define ETH_PTP_TSPCTLR_TSPOVIPV6                      (0x00001000UL)
#define ETH_PTP_TSPCTLR_TSPOVIPV4_POS                  (13U)
#define ETH_PTP_TSPCTLR_TSPOVIPV4                      (0x00002000UL)
#define ETH_PTP_TSPCTLR_TSPMTSEL_POS                   (14U)
#define ETH_PTP_TSPCTLR_TSPMTSEL                       (0x0003C000UL)
#define ETH_PTP_TSPCTLR_TSPMTSEL_0                     (0x00004000UL)
#define ETH_PTP_TSPCTLR_TSPMTSEL_1                     (0x00008000UL)
#define ETH_PTP_TSPCTLR_TSPMTSEL_2                     (0x00010000UL)
#define ETH_PTP_TSPCTLR_TSPMTSEL_3                     (0x00020000UL)
#define ETH_PTP_TSPCTLR_TSPADF_POS                     (18U)
#define ETH_PTP_TSPCTLR_TSPADF                         (0x00040000UL)

/*  Bit definition for ETH_PTP_TSPNSAR register  */
#define ETH_PTP_TSPNSAR_TSPNSEADD                      (0x000000FFUL)

/*  Bit definition for ETH_PTP_TMSSECR register  */
#define ETH_PTP_TMSSECR_TSPSYSSEC                      (0xFFFFFFFFUL)

/*  Bit definition for ETH_PTP_TMSNSER register  */
#define ETH_PTP_TMSNSER_TSPSYSNSEC                     (0x7FFFFFFFUL)

/*  Bit definition for ETH_PTP_TMUSECR register  */
#define ETH_PTP_TMUSECR_TSPUPSEC                       (0xFFFFFFFFUL)

/*  Bit definition for ETH_PTP_TMUNSER register  */
#define ETH_PTP_TMUNSER_TSPUPNSEC_POS                  (0U)
#define ETH_PTP_TMUNSER_TSPUPNSEC                      (0x7FFFFFFFUL)
#define ETH_PTP_TMUNSER_TSPUPNS_POS                    (31U)
#define ETH_PTP_TMUNSER_TSPUPNS                        (0x80000000UL)

/*  Bit definition for ETH_PTP_TSPADDR register  */
#define ETH_PTP_TSPADDR_TSPADD                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_PTP_TMTSECR0 register  */
#define ETH_PTP_TMTSECR0_TSPTAGSEC0                    (0xFFFFFFFFUL)

/*  Bit definition for ETH_PTP_TMTNSER0 register  */
#define ETH_PTP_TMTNSER0_TSPTAGNSEC0                   (0x7FFFFFFFUL)

/*  Bit definition for ETH_PTP_TSPSTSR register  */
#define ETH_PTP_TSPSTSR_TSOVF_POS                      (0U)
#define ETH_PTP_TSPSTSR_TSOVF                          (0x00000001UL)
#define ETH_PTP_TSPSTSR_TSTAR0_POS                     (1U)
#define ETH_PTP_TSPSTSR_TSTAR0                         (0x00000002UL)
#define ETH_PTP_TSPSTSR_TSERR0_POS                     (3U)
#define ETH_PTP_TSPSTSR_TSERR0                         (0x00000008UL)
#define ETH_PTP_TSPSTSR_TSTAR1_POS                     (4U)
#define ETH_PTP_TSPSTSR_TSTAR1                         (0x00000010UL)
#define ETH_PTP_TSPSTSR_TSERR1_POS                     (5U)
#define ETH_PTP_TSPSTSR_TSERR1                         (0x00000020UL)

/*  Bit definition for ETH_PTP_PPSCTLR register  */
#define ETH_PTP_PPSCTLR_PPSFRE0_POS                    (0U)
#define ETH_PTP_PPSCTLR_PPSFRE0                        (0x0000000FUL)
#define ETH_PTP_PPSCTLR_PPSFRE0_0                      (0x00000001UL)
#define ETH_PTP_PPSCTLR_PPSFRE0_1                      (0x00000002UL)
#define ETH_PTP_PPSCTLR_PPSFRE0_2                      (0x00000004UL)
#define ETH_PTP_PPSCTLR_PPSFRE0_3                      (0x00000008UL)
#define ETH_PTP_PPSCTLR_PPSOMD_POS                     (4U)
#define ETH_PTP_PPSCTLR_PPSOMD                         (0x00000010UL)
#define ETH_PTP_PPSCTLR_TT0SEL_POS                     (5U)
#define ETH_PTP_PPSCTLR_TT0SEL                         (0x00000060UL)
#define ETH_PTP_PPSCTLR_TT0SEL_0                       (0x00000020UL)
#define ETH_PTP_PPSCTLR_TT0SEL_1                       (0x00000040UL)
#define ETH_PTP_PPSCTLR_PPSFRE1_POS                    (8U)
#define ETH_PTP_PPSCTLR_PPSFRE1                        (0x00000700UL)
#define ETH_PTP_PPSCTLR_PPSFRE1_0                      (0x00000100UL)
#define ETH_PTP_PPSCTLR_PPSFRE1_1                      (0x00000200UL)
#define ETH_PTP_PPSCTLR_PPSFRE1_2                      (0x00000400UL)
#define ETH_PTP_PPSCTLR_TT1SEL_POS                     (13U)
#define ETH_PTP_PPSCTLR_TT1SEL                         (0x00006000UL)
#define ETH_PTP_PPSCTLR_TT1SEL_0                       (0x00002000UL)
#define ETH_PTP_PPSCTLR_TT1SEL_1                       (0x00004000UL)

/*  Bit definition for ETH_PTP_TMTSECR1 register  */
#define ETH_PTP_TMTSECR1_TSPTAGSEC1                    (0xFFFFFFFFUL)

/*  Bit definition for ETH_PTP_TMTNSER1 register  */
#define ETH_PTP_TMTNSER1_TSPTAGNSEC1                   (0x7FFFFFFFUL)

/*  Bit definition for ETH_DMA_BUSMODR register  */
#define ETH_DMA_BUSMODR_SWR_POS                        (0U)
#define ETH_DMA_BUSMODR_SWR                            (0x00000001UL)
#define ETH_DMA_BUSMODR_DMAA_POS                       (1U)
#define ETH_DMA_BUSMODR_DMAA                           (0x00000002UL)
#define ETH_DMA_BUSMODR_DSL_POS                        (2U)
#define ETH_DMA_BUSMODR_DSL                            (0x0000007CUL)
#define ETH_DMA_BUSMODR_DSL_0                          (0x00000004UL)
#define ETH_DMA_BUSMODR_DSL_1                          (0x00000008UL)
#define ETH_DMA_BUSMODR_DSL_2                          (0x00000010UL)
#define ETH_DMA_BUSMODR_DSL_3                          (0x00000020UL)
#define ETH_DMA_BUSMODR_DSL_4                          (0x00000040UL)
#define ETH_DMA_BUSMODR_DSEN_POS                       (7U)
#define ETH_DMA_BUSMODR_DSEN                           (0x00000080UL)
#define ETH_DMA_BUSMODR_TPBL_POS                       (8U)
#define ETH_DMA_BUSMODR_TPBL                           (0x00003F00UL)
#define ETH_DMA_BUSMODR_TPBL_0                         (0x00000100UL)
#define ETH_DMA_BUSMODR_TPBL_1                         (0x00000200UL)
#define ETH_DMA_BUSMODR_TPBL_2                         (0x00000400UL)
#define ETH_DMA_BUSMODR_TPBL_3                         (0x00000800UL)
#define ETH_DMA_BUSMODR_TPBL_4                         (0x00001000UL)
#define ETH_DMA_BUSMODR_TPBL_5                         (0x00002000UL)
#define ETH_DMA_BUSMODR_PRAT_POS                       (14U)
#define ETH_DMA_BUSMODR_PRAT                           (0x0000C000UL)
#define ETH_DMA_BUSMODR_PRAT_0                         (0x00004000UL)
#define ETH_DMA_BUSMODR_PRAT_1                         (0x00008000UL)
#define ETH_DMA_BUSMODR_FBST_POS                       (16U)
#define ETH_DMA_BUSMODR_FBST                           (0x00010000UL)
#define ETH_DMA_BUSMODR_RPBL_POS                       (17U)
#define ETH_DMA_BUSMODR_RPBL                           (0x007E0000UL)
#define ETH_DMA_BUSMODR_RPBL_0                         (0x00020000UL)
#define ETH_DMA_BUSMODR_RPBL_1                         (0x00040000UL)
#define ETH_DMA_BUSMODR_RPBL_2                         (0x00080000UL)
#define ETH_DMA_BUSMODR_RPBL_3                         (0x00100000UL)
#define ETH_DMA_BUSMODR_RPBL_4                         (0x00200000UL)
#define ETH_DMA_BUSMODR_RPBL_5                         (0x00400000UL)
#define ETH_DMA_BUSMODR_SPBL_POS                       (23U)
#define ETH_DMA_BUSMODR_SPBL                           (0x00800000UL)
#define ETH_DMA_BUSMODR_M8PBL_POS                      (24U)
#define ETH_DMA_BUSMODR_M8PBL                          (0x01000000UL)
#define ETH_DMA_BUSMODR_AAL_POS                        (25U)
#define ETH_DMA_BUSMODR_AAL                            (0x02000000UL)
#define ETH_DMA_BUSMODR_MBST_POS                       (26U)
#define ETH_DMA_BUSMODR_MBST                           (0x04000000UL)
#define ETH_DMA_BUSMODR_TXPR_POS                       (27U)
#define ETH_DMA_BUSMODR_TXPR                           (0x08000000UL)

/*  Bit definition for ETH_DMA_TXPOLLR register  */
#define ETH_DMA_TXPOLLR_TXPOLL                         (0xFFFFFFFFUL)

