MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0SITB/mcu.h
/*  Bit definition for GPIO_PIDRI register  */
#define GPIO_PIDRI_PIN00_POS                           (0U)
#define GPIO_PIDRI_PIN00                               (0x0001U)
#define GPIO_PIDRI_PIN01_POS                           (1U)
#define GPIO_PIDRI_PIN01                               (0x0002U)
#define GPIO_PIDRI_PIN02_POS                           (2U)
#define GPIO_PIDRI_PIN02                               (0x0004U)
#define GPIO_PIDRI_PIN03_POS                           (3U)
#define GPIO_PIDRI_PIN03                               (0x0008U)
#define GPIO_PIDRI_PIN04_POS                           (4U)
#define GPIO_PIDRI_PIN04                               (0x0010U)
#define GPIO_PIDRI_PIN05_POS                           (5U)
#define GPIO_PIDRI_PIN05                               (0x0020U)
#define GPIO_PIDRI_PIN06_POS                           (6U)
#define GPIO_PIDRI_PIN06                               (0x0040U)
#define GPIO_PIDRI_PIN07_POS                           (7U)
#define GPIO_PIDRI_PIN07                               (0x0080U)
#define GPIO_PIDRI_PIN08_POS                           (8U)
#define GPIO_PIDRI_PIN08                               (0x0100U)
#define GPIO_PIDRI_PIN09_POS                           (9U)
#define GPIO_PIDRI_PIN09                               (0x0200U)
#define GPIO_PIDRI_PIN10_POS                           (10U)
#define GPIO_PIDRI_PIN10                               (0x0400U)
#define GPIO_PIDRI_PIN11_POS                           (11U)
#define GPIO_PIDRI_PIN11                               (0x0800U)
#define GPIO_PIDRI_PIN12_POS                           (12U)
#define GPIO_PIDRI_PIN12                               (0x1000U)
#define GPIO_PIDRI_PIN13_POS                           (13U)
#define GPIO_PIDRI_PIN13                               (0x2000U)

/*  Bit definition for GPIO_PODRI register  */
#define GPIO_PODRI_POUT00_POS                          (0U)
#define GPIO_PODRI_POUT00                              (0x0001U)
#define GPIO_PODRI_POUT01_POS                          (1U)
#define GPIO_PODRI_POUT01                              (0x0002U)
#define GPIO_PODRI_POUT02_POS                          (2U)
#define GPIO_PODRI_POUT02                              (0x0004U)
#define GPIO_PODRI_POUT03_POS                          (3U)
#define GPIO_PODRI_POUT03                              (0x0008U)
#define GPIO_PODRI_POUT04_POS                          (4U)
#define GPIO_PODRI_POUT04                              (0x0010U)
#define GPIO_PODRI_POUT05_POS                          (5U)
#define GPIO_PODRI_POUT05                              (0x0020U)
#define GPIO_PODRI_POUT06_POS                          (6U)
#define GPIO_PODRI_POUT06                              (0x0040U)
#define GPIO_PODRI_POUT07_POS                          (7U)
#define GPIO_PODRI_POUT07                              (0x0080U)
#define GPIO_PODRI_POUT08_POS                          (8U)
#define GPIO_PODRI_POUT08                              (0x0100U)
#define GPIO_PODRI_POUT09_POS                          (9U)
#define GPIO_PODRI_POUT09                              (0x0200U)
#define GPIO_PODRI_POUT10_POS                          (10U)
#define GPIO_PODRI_POUT10                              (0x0400U)
#define GPIO_PODRI_POUT11_POS                          (11U)
#define GPIO_PODRI_POUT11                              (0x0800U)
#define GPIO_PODRI_POUT12_POS                          (12U)
#define GPIO_PODRI_POUT12                              (0x1000U)
#define GPIO_PODRI_POUT13_POS                          (13U)
#define GPIO_PODRI_POUT13                              (0x2000U)

/*  Bit definition for GPIO_POERI register  */
#define GPIO_POERI_POUTE00_POS                         (0U)
#define GPIO_POERI_POUTE00                             (0x0001U)
#define GPIO_POERI_POUTE01_POS                         (1U)
#define GPIO_POERI_POUTE01                             (0x0002U)
#define GPIO_POERI_POUTE02_POS                         (2U)
#define GPIO_POERI_POUTE02                             (0x0004U)
#define GPIO_POERI_POUTE03_POS                         (3U)
#define GPIO_POERI_POUTE03                             (0x0008U)
#define GPIO_POERI_POUTE04_POS                         (4U)
#define GPIO_POERI_POUTE04                             (0x0010U)
#define GPIO_POERI_POUTE05_POS                         (5U)
#define GPIO_POERI_POUTE05                             (0x0020U)
#define GPIO_POERI_POUTE06_POS                         (6U)
#define GPIO_POERI_POUTE06                             (0x0040U)
#define GPIO_POERI_POUTE07_POS                         (7U)
#define GPIO_POERI_POUTE07                             (0x0080U)
#define GPIO_POERI_POUTE08_POS                         (8U)
#define GPIO_POERI_POUTE08                             (0x0100U)
#define GPIO_POERI_POUTE09_POS                         (9U)
#define GPIO_POERI_POUTE09                             (0x0200U)
#define GPIO_POERI_POUTE10_POS                         (10U)
#define GPIO_POERI_POUTE10                             (0x0400U)
#define GPIO_POERI_POUTE11_POS                         (11U)
#define GPIO_POERI_POUTE11                             (0x0800U)
#define GPIO_POERI_POUTE12_POS                         (12U)
#define GPIO_POERI_POUTE12                             (0x1000U)
#define GPIO_POERI_POUTE13_POS                         (13U)
#define GPIO_POERI_POUTE13                             (0x2000U)

/*  Bit definition for GPIO_POSRI register  */
#define GPIO_POSRI_POS00_POS                           (0U)
#define GPIO_POSRI_POS00                               (0x0001U)
#define GPIO_POSRI_POS01_POS                           (1U)
#define GPIO_POSRI_POS01                               (0x0002U)
#define GPIO_POSRI_POS02_POS                           (2U)
#define GPIO_POSRI_POS02                               (0x0004U)
#define GPIO_POSRI_POS03_POS                           (3U)
#define GPIO_POSRI_POS03                               (0x0008U)
#define GPIO_POSRI_POS04_POS                           (4U)
#define GPIO_POSRI_POS04                               (0x0010U)
#define GPIO_POSRI_POS05_POS                           (5U)
#define GPIO_POSRI_POS05                               (0x0020U)
#define GPIO_POSRI_POS06_POS                           (6U)
#define GPIO_POSRI_POS06                               (0x0040U)
#define GPIO_POSRI_POS07_POS                           (7U)
#define GPIO_POSRI_POS07                               (0x0080U)
#define GPIO_POSRI_POS08_POS                           (8U)
#define GPIO_POSRI_POS08                               (0x0100U)
#define GPIO_POSRI_POS09_POS                           (9U)
#define GPIO_POSRI_POS09                               (0x0200U)
#define GPIO_POSRI_POS10_POS                           (10U)
#define GPIO_POSRI_POS10                               (0x0400U)
#define GPIO_POSRI_POS11_POS                           (11U)
#define GPIO_POSRI_POS11                               (0x0800U)
#define GPIO_POSRI_POS12_POS                           (12U)
#define GPIO_POSRI_POS12                               (0x1000U)
#define GPIO_POSRI_POS13_POS                           (13U)
#define GPIO_POSRI_POS13                               (0x2000U)

/*  Bit definition for GPIO_PORRI register  */
#define GPIO_PORRI_POR00_POS                           (0U)
#define GPIO_PORRI_POR00                               (0x0001U)
#define GPIO_PORRI_POR01_POS                           (1U)
#define GPIO_PORRI_POR01                               (0x0002U)
#define GPIO_PORRI_POR02_POS                           (2U)
#define GPIO_PORRI_POR02                               (0x0004U)
#define GPIO_PORRI_POR03_POS                           (3U)
#define GPIO_PORRI_POR03                               (0x0008U)
#define GPIO_PORRI_POR04_POS                           (4U)
#define GPIO_PORRI_POR04                               (0x0010U)
#define GPIO_PORRI_POR05_POS                           (5U)
#define GPIO_PORRI_POR05                               (0x0020U)
#define GPIO_PORRI_POR06_POS                           (6U)
#define GPIO_PORRI_POR06                               (0x0040U)
#define GPIO_PORRI_POR07_POS                           (7U)
#define GPIO_PORRI_POR07                               (0x0080U)
#define GPIO_PORRI_POR08_POS                           (8U)
#define GPIO_PORRI_POR08                               (0x0100U)
#define GPIO_PORRI_POR09_POS                           (9U)
#define GPIO_PORRI_POR09                               (0x0200U)
#define GPIO_PORRI_POR10_POS                           (10U)
#define GPIO_PORRI_POR10                               (0x0400U)
#define GPIO_PORRI_POR11_POS                           (11U)
#define GPIO_PORRI_POR11                               (0x0800U)
#define GPIO_PORRI_POR12_POS                           (12U)
#define GPIO_PORRI_POR12                               (0x1000U)
#define GPIO_PORRI_POR13_POS                           (13U)
#define GPIO_PORRI_POR13                               (0x2000U)

/*  Bit definition for GPIO_POTRI register  */
#define GPIO_POTRI_POT00_POS                           (0U)
#define GPIO_POTRI_POT00                               (0x0001U)
#define GPIO_POTRI_POT01_POS                           (1U)
#define GPIO_POTRI_POT01                               (0x0002U)
#define GPIO_POTRI_POT02_POS                           (2U)
#define GPIO_POTRI_POT02                               (0x0004U)
#define GPIO_POTRI_POT03_POS                           (3U)
#define GPIO_POTRI_POT03                               (0x0008U)
#define GPIO_POTRI_POT04_POS                           (4U)
#define GPIO_POTRI_POT04                               (0x0010U)
#define GPIO_POTRI_POT05_POS                           (5U)
#define GPIO_POTRI_POT05                               (0x0020U)
#define GPIO_POTRI_POT06_POS                           (6U)
#define GPIO_POTRI_POT06                               (0x0040U)
#define GPIO_POTRI_POT07_POS                           (7U)
#define GPIO_POTRI_POT07                               (0x0080U)
#define GPIO_POTRI_POT08_POS                           (8U)
#define GPIO_POTRI_POT08                               (0x0100U)
#define GPIO_POTRI_POT09_POS                           (9U)
#define GPIO_POTRI_POT09                               (0x0200U)
#define GPIO_POTRI_POT10_POS                           (10U)
#define GPIO_POTRI_POT10                               (0x0400U)
#define GPIO_POTRI_POT11_POS                           (11U)
#define GPIO_POTRI_POT11                               (0x0800U)
#define GPIO_POTRI_POT12_POS                           (12U)
#define GPIO_POTRI_POT12                               (0x1000U)
#define GPIO_POTRI_POT13_POS                           (13U)
#define GPIO_POTRI_POT13                               (0x2000U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x001FU)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)
#define GPIO_PSPCR_SPFE_2                              (0x0004U)
#define GPIO_PSPCR_SPFE_3                              (0x0008U)
#define GPIO_PSPCR_SPFE_4                              (0x0010U)

