MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0SITB/mcu.h
/*  Bit definition for USBHS_DIEPMSK register  */
#define USBHS_DIEPMSK_XFRCM_POS                        (0U)
#define USBHS_DIEPMSK_XFRCM                            (0x00000001UL)
#define USBHS_DIEPMSK_EPDM_POS                         (1U)
#define USBHS_DIEPMSK_EPDM                             (0x00000002UL)
#define USBHS_DIEPMSK_TOM_POS                          (3U)
#define USBHS_DIEPMSK_TOM                              (0x00000008UL)
#define USBHS_DIEPMSK_TTXFEMSK_POS                     (4U)
#define USBHS_DIEPMSK_TTXFEMSK                         (0x00000010UL)
#define USBHS_DIEPMSK_INEPNMM_POS                      (5U)
#define USBHS_DIEPMSK_INEPNMM                          (0x00000020UL)
#define USBHS_DIEPMSK_INEPNEM_POS                      (6U)
#define USBHS_DIEPMSK_INEPNEM                          (0x00000040UL)
#define USBHS_DIEPMSK_TXFURM_POS                       (8U)
#define USBHS_DIEPMSK_TXFURM                           (0x00000100UL)
#define USBHS_DIEPMSK_NAKM_POS                         (13U)
#define USBHS_DIEPMSK_NAKM                             (0x00002000UL)

/*  Bit definition for USBHS_DOEPMSK register  */
#define USBHS_DOEPMSK_XFRCM_POS                        (0U)
#define USBHS_DOEPMSK_XFRCM                            (0x00000001UL)
#define USBHS_DOEPMSK_EPDM_POS                         (1U)
#define USBHS_DOEPMSK_EPDM                             (0x00000002UL)
#define USBHS_DOEPMSK_STUPM_POS                        (3U)
#define USBHS_DOEPMSK_STUPM                            (0x00000008UL)
#define USBHS_DOEPMSK_OTEPDM_POS                       (4U)
#define USBHS_DOEPMSK_OTEPDM                           (0x00000010UL)
#define USBHS_DOEPMSK_B2BSTUP_POS                      (6U)
#define USBHS_DOEPMSK_B2BSTUP                          (0x00000040UL)
#define USBHS_DOEPMSK_OPEM_POS                         (8U)
#define USBHS_DOEPMSK_OPEM                             (0x00000100UL)
#define USBHS_DOEPMSK_NYETM_POS                        (14U)
#define USBHS_DOEPMSK_NYETM                            (0x00004000UL)

/*  Bit definition for USBHS_DAINT register  */
#define USBHS_DAINT_IEPINT_POS                         (0U)
#define USBHS_DAINT_IEPINT                             (0x0000FFFFUL)
#define USBHS_DAINT_OEPINT_POS                         (16U)
#define USBHS_DAINT_OEPINT                             (0xFFFF0000UL)

/*  Bit definition for USBHS_DAINTMSK register  */
#define USBHS_DAINTMSK_IEPINTM_POS                     (0U)
#define USBHS_DAINTMSK_IEPINTM                         (0x0000FFFFUL)
#define USBHS_DAINTMSK_OEPINTM_POS                     (16U)
#define USBHS_DAINTMSK_OEPINTM                         (0xFFFF0000UL)

/*  Bit definition for USBHS_DTHRCTL register  */
#define USBHS_DTHRCTL_NONISOTHREN_POS                  (0U)
#define USBHS_DTHRCTL_NONISOTHREN                      (0x00000001UL)
#define USBHS_DTHRCTL_ISOTHREN_POS                     (1U)
#define USBHS_DTHRCTL_ISOTHREN                         (0x00000002UL)
#define USBHS_DTHRCTL_TXTHRLEN_POS                     (2U)
#define USBHS_DTHRCTL_TXTHRLEN                         (0x000007FCUL)
#define USBHS_DTHRCTL_RXTHREN_POS                      (16U)
#define USBHS_DTHRCTL_RXTHREN                          (0x00010000UL)
#define USBHS_DTHRCTL_RXTHRLEN_POS                     (17U)
#define USBHS_DTHRCTL_RXTHRLEN                         (0x03FE0000UL)
#define USBHS_DTHRCTL_ARPEN_POS                        (27U)
#define USBHS_DTHRCTL_ARPEN                            (0x08000000UL)

/*  Bit definition for USBHS_DIEPEMPMSK register  */
#define USBHS_DIEPEMPMSK_INEPTXFEM                     (0x0000FFFFUL)

/*  Bit definition for USBHS_DEACHINT register  */
#define USBHS_DEACHINT_IEP1INT_POS                     (1U)
#define USBHS_DEACHINT_IEP1INT                         (0x00000002UL)
#define USBHS_DEACHINT_OEP1INT_POS                     (17U)
#define USBHS_DEACHINT_OEP1INT                         (0x00020000UL)

/*  Bit definition for USBHS_DEACHINTMSK register  */
#define USBHS_DEACHINTMSK_IEP1INTM_POS                 (1U)
#define USBHS_DEACHINTMSK_IEP1INTM                     (0x00000002UL)
#define USBHS_DEACHINTMSK_OEP1INTM_POS                 (17U)
#define USBHS_DEACHINTMSK_OEP1INTM                     (0x00020000UL)

/*  Bit definition for USBHS_DIEPEACHMSK1 register  */
#define USBHS_DIEPEACHMSK1_XFRCM_POS                   (0U)
#define USBHS_DIEPEACHMSK1_XFRCM                       (0x00000001UL)
#define USBHS_DIEPEACHMSK1_EPDM_POS                    (1U)
#define USBHS_DIEPEACHMSK1_EPDM                        (0x00000002UL)
#define USBHS_DIEPEACHMSK1_TOM_POS                     (3U)
#define USBHS_DIEPEACHMSK1_TOM                         (0x00000008UL)
#define USBHS_DIEPEACHMSK1_TTXFEMSK_POS                (4U)
#define USBHS_DIEPEACHMSK1_TTXFEMSK                    (0x00000010UL)
#define USBHS_DIEPEACHMSK1_INEPNMM_POS                 (5U)
#define USBHS_DIEPEACHMSK1_INEPNMM                     (0x00000020UL)
#define USBHS_DIEPEACHMSK1_INEPNEM_POS                 (6U)
#define USBHS_DIEPEACHMSK1_INEPNEM                     (0x00000040UL)
#define USBHS_DIEPEACHMSK1_TXFURM_POS                  (8U)
#define USBHS_DIEPEACHMSK1_TXFURM                      (0x00000100UL)
#define USBHS_DIEPEACHMSK1_NAKM_POS                    (13U)
#define USBHS_DIEPEACHMSK1_NAKM                        (0x00002000UL)

/*  Bit definition for USBHS_DOEPEACHMSK1 register  */
#define USBHS_DOEPEACHMSK1_XFRCM_POS                   (0U)
#define USBHS_DOEPEACHMSK1_XFRCM                       (0x00000001UL)
#define USBHS_DOEPEACHMSK1_EPDM_POS                    (1U)
#define USBHS_DOEPEACHMSK1_EPDM                        (0x00000002UL)
#define USBHS_DOEPEACHMSK1_STUPM_POS                   (3U)
#define USBHS_DOEPEACHMSK1_STUPM                       (0x00000008UL)
#define USBHS_DOEPEACHMSK1_OTEPDM_POS                  (4U)
#define USBHS_DOEPEACHMSK1_OTEPDM                      (0x00000010UL)
#define USBHS_DOEPEACHMSK1_B2BSTUP_POS                 (6U)
#define USBHS_DOEPEACHMSK1_B2BSTUP                     (0x00000040UL)
#define USBHS_DOEPEACHMSK1_OPEM_POS                    (8U)
#define USBHS_DOEPEACHMSK1_OPEM                        (0x00000100UL)
#define USBHS_DOEPEACHMSK1_NYETM_POS                   (14U)
#define USBHS_DOEPEACHMSK1_NYETM                       (0x00004000UL)

/*  Bit definition for USBHS_DIEPCTL0 register  */
#define USBHS_DIEPCTL0_MPSIZ_POS                       (0U)
#define USBHS_DIEPCTL0_MPSIZ                           (0x00000003UL)
#define USBHS_DIEPCTL0_USBAEP_POS                      (15U)
#define USBHS_DIEPCTL0_USBAEP                          (0x00008000UL)
#define USBHS_DIEPCTL0_NAKSTS_POS                      (17U)
#define USBHS_DIEPCTL0_NAKSTS                          (0x00020000UL)
#define USBHS_DIEPCTL0_EPTYP_POS                       (18U)
#define USBHS_DIEPCTL0_EPTYP                           (0x000C0000UL)
#define USBHS_DIEPCTL0_STALL_POS                       (21U)
#define USBHS_DIEPCTL0_STALL                           (0x00200000UL)
#define USBHS_DIEPCTL0_TXFNUM_POS                      (22U)
#define USBHS_DIEPCTL0_TXFNUM                          (0x03C00000UL)
#define USBHS_DIEPCTL0_CNAK_POS                        (26U)
#define USBHS_DIEPCTL0_CNAK                            (0x04000000UL)
#define USBHS_DIEPCTL0_SNAK_POS                        (27U)
#define USBHS_DIEPCTL0_SNAK                            (0x08000000UL)
#define USBHS_DIEPCTL0_EPDIS_POS                       (30U)
#define USBHS_DIEPCTL0_EPDIS                           (0x40000000UL)
#define USBHS_DIEPCTL0_EPENA_POS                       (31U)
#define USBHS_DIEPCTL0_EPENA                           (0x80000000UL)

/*  Bit definition for USBHS_DIEPINT register  */
#define USBHS_DIEPINT_XFRC_POS                         (0U)
#define USBHS_DIEPINT_XFRC                             (0x00000001UL)
#define USBHS_DIEPINT_EPDISD_POS                       (1U)
#define USBHS_DIEPINT_EPDISD                           (0x00000002UL)
#define USBHS_DIEPINT_TOC_POS                          (3U)
#define USBHS_DIEPINT_TOC                              (0x00000008UL)
#define USBHS_DIEPINT_TTXFE_POS                        (4U)
#define USBHS_DIEPINT_TTXFE                            (0x00000010UL)
#define USBHS_DIEPINT_INEPNE_POS                       (6U)
#define USBHS_DIEPINT_INEPNE                           (0x00000040UL)
#define USBHS_DIEPINT_TXFE_POS                         (7U)
#define USBHS_DIEPINT_TXFE                             (0x00000080UL)
#define USBHS_DIEPINT_TXFIFOUDRN_POS                   (8U)
#define USBHS_DIEPINT_TXFIFOUDRN                       (0x00000100UL)
#define USBHS_DIEPINT_PKTDRPSTS_POS                    (11U)
#define USBHS_DIEPINT_PKTDRPSTS                        (0x00000800UL)
#define USBHS_DIEPINT_BERR_POS                         (12U)
#define USBHS_DIEPINT_BERR                             (0x00001000UL)
#define USBHS_DIEPINT_NAK_POS                          (13U)
#define USBHS_DIEPINT_NAK                              (0x00002000UL)

